[{
    "searchingFlights": [
        "I'm putting in a call to the hanger now. Patience, my friend, adventure is worthwhile in itself! Give me just a jiffy to secure your passage. Don't worry, we'll get you off the ground.",
        "Stand by for the details, there's a good sport. I'm tuning the wireless to get the latest dispatch on available routes. We must find a flight that's absolutely the cat's pajamas.",
        "One moment, please. I'm just checking the manifest and the charts to plot your course. A good flier never takes off without the proper dope on the weather and the runway!",
        "Just a quick check of the aeonautical data! I'm making sure your journey is the real McCoy. Hold the line while I pin down the exact route and the cost of the high-test gasoline.",
        "A brief delay while I consult my logbook and the control tower. Rememner, the most effective way to do it is to do it! I'll be right back with the flight details, Consider it clear sailing from here."
    ],
    "genericError": [
        "Heavens to Betsy, there's been a spot of trouble with the radio signal! I can't quite get a clear reading on the flight data right now. The wire seems to be down, and I'll need to adjust the rigging before trying again.",
        "My sincere apologies, but the information seems to have flown the coop! I've hit a snag in the machinery and can't pull up the details you need. It looks like the system needs a bit of tinkering with the engine",
        "Blast! We've run into some unexpected atmospheric interference - the air is too thick with static! I couldn't get the flight information to come through. Let's give it a minute for the fog to lift before attempting that approach again.",
        "Rats! I've been given a load of bunk by the control tower! The data didn't make sense, and I couldn't plot a reliable course. Something is definitely on the fritz; I'll need to check my instruments again.",
        "Well, I'm absolutely stumped. The flight details are missing in action! I'm sorry, but this particular search seems to have ended in a forced landing before I could get you the results. Please try again or adjust your destination."
    ],
    "noDestIATA": [
        "I'm afraid I can't chart your course just yet — I couldn't spot a city or airport in your request. Give me a clearer destination, and I'll get your wings ready without delay.",
        "The sky's wide open, but I need to know where you're bound. I didn't catch a recognizable airport or city in your message. Point me toward your intended landing field.",
        "I scanned the maps from stem to stern, but your destination didn't show up on any chart I trust. Tell me where you're headed, and I'll plot a proper route for you.",
        "Even the best navigator needs a fix on where they're going. I didn't pick up any valid airport or city name — mind giving me the destination again?",
        "I'm ready to fly, but I can't lift off without knowing where you'd like to land. No destination matched my records — give me the spot, and I'll handle the rest."
    ],
    "flightResult": [
        "All right, we've got a course plotted! Here's what I've dug up for your hop from {{ORIGIN}} to {{DESTINATION}}. First up, {{AIRLINE_1}} has a ship leaving at {{DEPARTURE_TIME_1}} on {{DEPARTURE_DATE_1}}, touching down at {{ARRIVAL_AIRPORT_1}} by {{ARRIVAL_TIME_1}}. That one will set you back {{PRICE_1}}.\nIf you'd prefer another route, {{AIRLINE_2}} departs at {{DEPARTURE_TIME_2}} on {{DEPARTURE_DATE_2}}, landing at {{ARRIVAL_AIRPORT_2}} come {{ARRIVAL_TIME_2}}. The fare there runs about {{PRICE_2}}. Not a bad selection for today's skies!",
        "Your wings are ready, friend! I've charted a couple of promising routes from {{ORIGIN}} to {{DESTINATION}}. The first is with {{AIRLINE_1}}, taking off at {{DEPARTURE_TIME_1}} on {{DEPARTURE_DATE_1}} and setting down at {{ARRIVAL_AIRPORT_1}} at {{ARRIVAL_TIME_1}}. The ticket tallies up to {{PRICE_1}}.\nIf you're keen on alternatives, {{AIRLINE_2}} is launching at {{DEPARTURE_TIME_2}} the same day, landing at {{ARRIVAL_AIRPORT_2}} by {{ARRIVAL_TIME_2}}. That journey comes in at {{PRICE_2}}. I'd call that a fine selection of skies to sail.",
        "Good news — I've scouted out the air lanes for your trip from {{ORIGIN}} to {{DESTINATION}}. One option is {{AIRLINE_1}}, taking wing at {{DEPARTURE_TIME_1}} on {{DEPARTURE_DATE_1}} and rolling up to {{ARRIVAL_AIRPORT_1}} at {{ARRIVAL_TIME_1}}. This fare is marked at {{PRICE_1}}.\nAnother dependable flight comes from {{AIRLINE_2}}, leaving at {{DEPARTURE_TIME_2}} on that same date, arriving at {{ARRIVAL_AIRPORT_2}} by {{ARRIVAL_TIME_2}}. That trip goes for {{PRICE_2}}. Choose whichever path feels like fair weather to you!",
        "I've dusted off the maps and checked the wind sock — here are two solid flights for your journey from {{ORIGIN}} to {{DESTINATION}}. First up, {{AIRLINE_1}} takes off at {{DEPARTURE_TIME_1}} on {{DEPARTURE_DATE_1}}, gliding into {{ARRIVAL_AIRPORT_1}} at {{ARRIVAL_TIME_1}}. Damage to the wallet: {{PRICE_1}}.\nIf that doesn't tickle your fancy, {{AIRLINE_2}} departs at {{DEPARTURE_TIME_2}} and touches down at {{ARRIVAL_AIRPORT_2}} at {{ARRIVAL_TIME_2}} for {{PRICE_2}}. Either way, the air looks smooth from here.",
        "I've gathered the details you'll need for a smooth flight from {{ORIGIN}} to {{DESTINATION}}. One promising path is with {{AIRLINE_1}}, leaving at {{DEPARTURE_TIME_1}} on {{DEPARTURE_DATE_1}} and arriving at {{ARRIVAL_AIRPORT_1}} come {{ARRIVAL_TIME_1}}. The fare stands at {{PRICE_1}}.\nYour second choice is {{AIRLINE_2}}, departing at {{DEPARTURE_TIME_2}} and reaching {{ARRIVAL_AIRPORT_2}} by {{ARRIVAL_TIME_2}} for {{PRICE_2}}. Either route should carry you steadily toward your next adventure."
    ],
    "noFlightsFound": [
        "Well now, I combed through every air lane I know, but not a single flight turned up for that route. Looks like the skies between {{ORIGIN}} and {{DESTINATION}} are quiet today.",
        "I hate to say it, but the control tower reports no scheduled flights for that journey. The route from {{ORIGIN}} to {{DESTINATION}} seems to be grounded for now.",
        "I've checked the itineraries, the manifests, and even the fine print — not a whisper of a flight between {{ORIGIN}} and {{DESTINATION}} at the moment. We may need to try a different day or airport.",
        "I couldn't scare up a single ticket for that hop. The airfields between {{ORIGIN}} and {{DESTINATION}} seem to be taking a rest. Care to try another combination?",
        "Not a soul is flying that stretch today. Nothing available between {{ORIGIN}} and {{DESTINATION}} in the current schedules. Let's chart a different course and see what we can find."
    ]
}]